# -*- coding: utf-8 -*-
# @Time : 2021/7/7 00:43 上午
# @Author : HanChen
# @File : 2_9__2_10.py
# @Software: Sublime Text

# ------------------ example01 ------------------
"""
2-9 最喜欢的数字：将你最喜欢的数字存储在一个变量中，再使用这个变量创建一条消息，指出你最喜欢的数字，然后将这条消息打印出来。
2-10 添加注释：选择你编写的两个程序，在每个程序中都至少添加一条注释。如果程序太简单，实在没有什么需要说明的，就在程序文件开头加上你的姓名和当前日期，再用一句话阐述程序的功能。
"""
# 定义变量，存储你最喜欢的数字
favorite_number = 2
# 打印消息，指出你最喜欢的数字
print("My favorite number is " + str(favorite_number) + ".")
# ------------------ example01 ------------------
