# -*- coding: utf-8 -*-
# @Time : 2021/7/7 00:43 上午
# @Author : HanChen
# @File : number.py
# @Software: Sublime Text

# ------------------ example01 ------------------
"""
2-8 数字8：编写4个表达式，它们分别使用加法、减法、乘法和除法运算，但结果都是数字8。为使用print语句来显示结果，务必将这些表达式用括号括起来，也就是说，你应该编写4行类似于下面的代码：
    print(5 + 3)
    输出应为4行，其中每行都只包含数字8。
2-10 添加注释：选择你编写的两个程序，在每个程序中都至少添加一条注释。如果程序太简单，实在没有什么需要说明的，就在程序文件开头加上你的姓名和当前日期，再用一句话阐述程序的功能。
"""
# 使用加法运算结果为8
print(5 + 3)
# 使用减法运算结果为8
print(10 - 2)
# 使用乘法运算结果为8
print(2 * 4)
# 使用除法运算结果为8
print(8 / 1)
# ------------------ example01 ------------------
